commands = {
    'start': 'Привет! Часто начинающие и не только программисты хотят найти себе друга-напрника, но не знают где.'\
             'Этот бот специально создан для этого! Напиши /help чтобы узнать больше про работу бота!',
    'help': 'Чтобы начать поиск вам надо создать профиль с помощью команды /create_profile\n\n'\
            'Посмотреть профиль можно командой /watch_profile\n\n'\
            'Профиль можно также редактировать /edit_profile или удалить полностью /delete_profile',
    'edit_profile_menu': 'Выберите то, что хотите исправить',
    'edit_accept_or_not': 'Вы точно хотите изменить данные?',
    'edit_accept': 'Данные успешно обновлены!',
    'edit_stop': 'Ваш профиль отредактирован, можете продолжать поиск!'
}

profile = {
    'create_profile_error': 'У вас уже есть профиль!\n\nУдалите его или редактируйте!',
    'name': 'Введите свое имя',
    'sex': 'Выберите свой пол',
    'age': 'Введите свой возраст',
    'incorrect_age': 'Вы ввели некорректный возраст!',
    'city': 'Введите свой город',
    'incorrect_city': 'Вы ввели несуществующий город!',
    'set_first_languages': 'Выберите языки программирования, которыми вы пользуетесь или интересуетесь',
    'set_other_languages': 'Вы выбрали {}\nВыберите еще языки или нажмите продолжить если закончили выбирать',
    'description': 'Расскажите подробнее о себе, своих проектах, интересах и т.д',
    'photo': 'Отправьте фото профиля',
    'incorrect_photo': 'Отправьте фото, а не какую то хуйню, чухан балят',
    'end_registration': 'Вы успешно создали профиль!'
}

watch_profile = {
    'watch': 'Ваш профиль:\n\nИмя: {}\nПол: {}\nВозраст: {}\n'\
                     'Город: {}\nЯзыки программирования: {}\nОписание: {}',
    'watch_error': 'Вы лох, удалите телеграм. А если без шуток, '\
                   'то вы и правда лох, потому что у вас нет профиля!'
}

delete_profile = {
    'delete': 'Вы точно хотите удалить свой профиль?',
    'delete_error': 'У вас нет профиля, чтобы удалять его!',
    'accept_delete': 'Вы успешно удалили профиль!\n '\
                     'Но вы можете создать новый профиль в любой момент',
    'not_accept_delete': 'А нахуй нажимал тогда ишак баля?'
}

edit_profile = {
    'name': 'Имя',
    'sex': 'Пол',
    'age': 'Возраст',
    'city': 'Город',
    'languages': 'Языки программирования',
    'description': 'Описание профиля',
    'photo': 'Фото профиля',
    'stop': 'Закончить редактирование',
    'edit_error': 'У вас нет профиля, чтобы его редактировать!'
}

edit_accept_buttons = {
    'save': 'Сохранить',
    'back_to_menu': 'Вернуться в меню'
}

edit_stop_or_not_buttons = {
    'back_to_menu': 'Продолжить',
    'stop': 'Закончить редактирование'
}

search = {
    'profile': 'Имя: {}\nПол: {}\nВозраст: {}\n'\
                    'Город: {}\nЯзыки программирования: {}\nОписание: {}',
    'profiles_none': 'Вы просмотрели все подходящие вам профили, возвращайтесь позже!',
    'profile_like': 'Вас кто-то оценил!\nВот его профиль:\n\n'\
                    'Имя: {}\nПол: {}\nВозраст: {}\n'\
                    'Город: {}\nЯзыки программирования: {}\nОписание: {}',
    'search_error': 'У вас нет профиля, создайте его, чтобы начать поиск!'
}

profile_assessment_buttons = {
    'like': '👍🏻',
    'dislike': '👎🏻',
    'message': 'Написать пользователю',
}

bot_commands = {
    'start': 'Начало работы',
    'help': 'Помощь',
    'create_profile': 'Создать профиль',
    'edit_profile': 'Редактировать профиль',
    'delete_profile': 'Удалить профиль',
    'search': 'Искать напарника',
    'watch_profile': 'Посмотреть профиль'
}

other_buttons = {
    'next': 'Продолжить',
}

yes_no_buttons = {
    'yes': 'Да',
    'no': 'Нет'
}

sex = {
    'man': 'Мужской',
    'woman': 'Женский'
}
